---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeIterator.MoveNext
source: html/23ea8d0b-5026-d13c-e2c9-decd5c20ce2a.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.